app/controllers/sessions_controller.rb

  def create
    teacher = Teacher.find_by_email(params[:email])
---
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."email" = ? LIMIT 1  [["email", "sol@gmail.com"]]