app/controllers/teachers_controller.rb

  def create
    @teacher = Teacher.new(teacher_params)

    if @teacher.save
---
INSERT INTO "teachers" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

    def set_teacher
      @teacher = Teacher.find(params[:id])
---
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" IS NULL  ORDER BY "teachers"."id" ASC LIMIT 1